#использовать "../src"
#Использовать asserts
#Использовать logos

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьРаботуКласса");


	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКласса() Экспорт

	ОбщийЛог = Логирование.ПолучитьЛог("testlog");
	ОбщийЛог.УстановитьУровень(УровниЛога.Отладка);
	
	ЦветнойВывод = Новый ЦветнойВыводЛогаКонсоль;
	
	ОбщийЛог.ДобавитьСпособВывода(ЦветнойВывод);

	Лог = ОбщийЛог.Поля("prefix", "data");

	Лог.Отладка("Это отладка");
	Лог.Информация("Тестовая информация");
	Лог.Поля("prefix", "sys").Предупреждение("Тестовая информация");
	Лог.Поля("prefix", "connect", "корова", 200).Ошибка("Тестовая информация");
	Лог.КритичнаяОшибка("Тестовая информация");

	// Утверждения.ПроверитьРавенство(МеткаВремени, 1514764800, "Полученные числа должны быть равны");

КонецПроцедуры




